ednieuw/ESP32SerialNTP-BLE-Clock/ESP32C3S3_SerialClockV011.ino
/* 
Code to update time in ATMEGA328 B&W word clock.
--------------------------------------  
 Author .    : Ed Nieuwenhuys
 Changes V001: Derived from ESP32C3S3_WordClockV033 and ESP32Arduino_WordClockV029.ino
 Changes V005: ESP32-S3-Zero Working version 
 Changes V006: Cleaning up. Updated Webpage and SetStatusLeds
 Changes V007: ESP32C3_SUPERMINI Working version 
 Changes V008: ESP32C3_DEV = ESP-C3-12F-Kit Working version  
 Changes V009: Arduino Nano ESP32 Working version
 Changes V010: Updated web page
 Changes V011: Stable version

How to compile: Install ESP32 boards
ESP32C3_SUPERMINI
Elect Board: Nologo ESP32C3 Super mini
Compile and upload

ESP32S3_ZERO
Board: ESP32-C3 DEV module or ESP32-S3 DEV module
Flash size 4MB ot 2MB if you have a cheaper 2MB board.
OTA will not work on 2MB boards
Patition Scheme: Default or change to Minimal SPIFFS (1.9Mb with OTA, 190kB SPIFFS) if there is a memoty shortage
USB-CDC on boot: ENABLED


How to compile for Arduino Nano ESP32: 
Install Arduino Nano ESP32 boards
Board: Arduino Nano ESP32
Partition Scheme: With FAT
Pin Numbering: By GPIO number (legacy)

*/
// =============================================================================================================================
//#define ESP32C3_SUPERMINI   // ESP32-C3-Supermini
//#define ESP32S3_ZERO        // ESP32-S3-Zero
//#define ESP32C3_DEV         // ESP-C3-12F-Kit 
//#define ESP32S3_DEV         // ESP32-S3 Not yet implemented
#define NANOESP32           // Arduino Nano ESP32

//--------------------------------------------                                                //
// ESP32-C3 Includes defines and initialisations
//--------------------------------------------

#include <NimBLEDevice.h>      // For BLE communication  https://github.com/h2zero/NimBLE-Arduino 1.4.1
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <ElegantOTA.h>        // Used for OTA
#include <Preferences.h>
#include <Adafruit_NeoPixel.h> 
//--------------------------------------------                                                //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

// Pin Assignments
                        #ifdef ESP32C3_DEV
#define  REDPIN       3
#define  GREENPIN     4
#define  BLUEPIN      5
#define  COLD_WHITE  18
#define  WARM_WHITE  19
#define  RX1PIN       2  // Connect to RX
#define  TX1PIN       1   
                        #endif

                        #ifdef ESP32S3_ZERO
#define RX1PIN 5
#define TX1PIN 4                         
#define BRIGHTNESS 20 // Set BRIGHTNESS (max = 255)
Adafruit_NeoPixel strip = Adafruit_NeoPixel(1, 21, NEO_RGB + NEO_KHZ800);                     // RGB LED on ESP32-S3-Zero GPIO21
                           #endif // ESP32S3_ZERO                     

                        #ifdef ESP32C3_SUPERMINI
#define LEDPIN 8
#define RX1PIN 3
#define TX1PIN 4 
                        #endif //ESP32C3_SUPERMINI
                        #ifdef NANOESP32 
#define RX1PIN A6  //13  //A6  Connect to Rx
#define TX1PIN A7 // 14  //A7  Connect to Tx
                        #endif //NANOESP32
//--------------------------------------------                                                //
// CLOCK initialysations
//--------------------------------------------                                 
static  uint32_t msTick;                                                                      // Number of millisecond ticks since we last incremented the second counter
byte    lastminute = 0, lasthour = 0, lastday = 0;
struct  tm timeinfo;                                                                          // storage of time 

//--------------------------------------------                                                //
// BLE   //#include <NimBLEDevice.h>
//--------------------------------------------
bool deviceConnected    = false;
bool oldDeviceConnected = false;
BLEServer *pServer = NULL;
BLECharacteristic * pTxCharacteristic;
std::string ReceivedMessageBLE;

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // UART service UUID
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//--------------------------------------------                                                //
// WEBSERVER
//----------------------------------------
int WIFIConnected = 0;              // Is wIFI connected?
AsyncWebServer server(80);          // For OTA Over the air uploading
#include "Webpage.h"
//----------------------------------------
// NTP
//----------------------------------------
boolean syncEventTriggered = false;                                                           // True if a time even has been triggered
NTPEvent_t ntpEvent;                                                                          // Last triggered event
//--------------------------------------------                                                //
// Common
//----------------------------------------
uint64_t Loopcounter = 0;
#define MAXTEXT 140
char sptext[MAXTEXT];                                                                         // For common print use 
bool SerialConnected = true;   
struct EEPROMstorage {                                                                        // Data storage in EEPROM to maintain them after power loss 
  byte DisplayChoice    = 0;                                                                  // Struct is used in all ednieuw project
  byte TurnOffLEDsAtHH  = 0;
  byte TurnOnLEDsAtHH   = 0;                                                                  // 
  byte LanguageChoice   = 0;
  byte LightReducer     = 0;
  int  LowerBrightness  = 0;
  int  UpperBrightness  = 0;
  int  NVRAMmem[24];                                                                          // LDR readings
  byte BLEOn            = 1;
  byte NTPOn            = 1;
  byte WIFIOn           = 1;  
  byte StatusLEDsOn     = 1;
  int  ReconnectWIFI    = 0;                                                                  // No of times WIFI reconnected 
  byte UseSDcard        = 0;
  byte WIFINoOfRestarts = 0;                                                                  // If 1 than resart MCU once
  byte UseDS3231        = 0;                                                                  // Use the DS3231 time module 
  byte LEDstrip         = 0;                                                                  // 0 = SK6812 LED strip. 1 = WS2812 LED strip
  byte ByteFuture3      = 0;                                                                  // For future use
  byte ByteFuture4      = 0;                                                                  // For future use
  byte UseBLELongString = 0;                                                                  // Send strings longer than 20 bytes per message. Possible in IOS app BLEserial Pro 
  uint32_t OwnColour    = 0;                                                                  // Self defined colour for clock display
  uint32_t DimmedLetter = 0;
  uint32_t BackGround   = 0;
  char Ssid[30];                                                                              // 
  char Password[40];                                                                          // 
  char BLEbroadcastName[30];                                                                  // Name of the BLE beacon
  char Timezone[50];
  int  Checksum        = 0;
}  Mem; 
//--------------------------------------------                                                //
// Menu
//0        1         2         3         4
//1234567890123456789012345678901234567890----  
 char menu[][40] = {
 "?A SSID B Password C BLE beacon name",
 "?D Date (D15012021) T Time (T132145)",
 "?E Timezone  (E<-02>2 or E<+01>-1)",
 "?I To print this Info menu",
 "?P Status LED toggle On/Off", 
 "?R Reset settings @ = Reset MCU",
 "?W=WIFI  ?X=NTP& ?Y=BLE  ?Z=Fast BLE", 
 "Ed Nieuwenhuys Jun 2024" };
 
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(9600);                                                                          // Setup the serial port to 9600 baud //
 Serial1.begin(9600, SERIAL_8N1, RX1PIN, TX1PIN);                                             // Serial1.begin(9600, SERIAL_8N1, RX1PIN, TX1PIN);                                            // Setup the serial port to 115200 baud //

